namespace DogWalkerBlazor.Utilities
{
    public static class GlobalConstants
    {
        public static readonly Dictionary<int, string> UserRoles = new()
        {
            { 0, "בעל כלב" },
            { 1, "דוג ווקר" },
            { 2, "מספרת כלבים" },
            { 3, "וטרינר" },
            { 4, "מנהל" }
        };

        public static string GetUserRoleText(int userRole)
        {
            return UserRoles.TryGetValue(userRole, out var role) ? role : "לא ידוע";
        }

        public static readonly List<string> IsraelCities = new()
        {
            "ירושלים",
            "תל אביב-יפו",
            "חיפה",
            "ראשון לציון",
            "פתח תקווה",
            "אשדוד",
            "נתניה",
            "באר שבע",
            "בני ברק",
            "חולון",
            "רמת גן",
            "אשקלון",
            "רחובות",
            "בת ים",
            "בית שמש",
            "כפר סבא",
            "הרצליה",
            "חדרה",
            "מודיעין-מכבים-רעות",
            "נצרת",
            "לוד",
            "רמלה",
            "רעננה",
            "מודיעין עילית",
            "רהט",
            "ביתר עילית",
            "הוד השרון",
            "נהריה",
            "קריית גת",
            "קריית אתא",
            "אילת",
            "עפולה",
            "אום אל-פחם",
            "יבנה",
            "ראש העין",
            "נס ציונה",
            "אלעד",
            "עכו",
            "רמת השרון",
            "טבריה",
            "כרמיאל",
            "נוף הגליל",
            "גבעתיים",
            "קריית ים",
            "קריית מוצקין",
            "קריית ביאליק",
            "נתיבות",
            "צפת",
            "דימונה",
            "אור יהודה",
            "טייבה",
            "שפרעם",
            "אופקים",
            "יהוד-מונוסון",
            "באקה אל-גרביה",
            "ערד",
            "טירה",
            "קריית שמונה",
            "מעלה אדומים",
            "סח'נין",
            "תמרה",
            "מגדל העמק"
        };
    }
} 